Repository: ministryofjustice/money-to-prisoners-api
Catalog: mtp_api/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Bank account management
cy: Rheoli cyfrif banc

source: Send money to a prisoner
cy: Anfon arian at garcharor

source: All
cy: Pob un

source: Start date
cy: Dyddiad cychwyn

source: End date
cy: Dyddiad gorffen

source: Date in range
cy: Dyddiad o fewn yr ystod

source: Start UTC date
cy: Dyddiad cychwyn UTC

source: End UTC date
cy: Dyddiad gorffen UTC

source: UTC date in range
cy: Dyddiad UTC o fewn yr ystod

source: Date
cy: Dyddiad

source: Search
cy: Chwilio

source: Search %(fieldname)s
cy: Chwilio %(fieldname)s

source: Any
cy: Unrhyw un

source: Dashboard
cy: Dangosfwrdd

source: External dashboards and logs
cy: Dangosfyrddau a logiau allanol

source: Application dashboard
cy: Dangosfwrdd yr adnodd

source: All apps
cy: Pob adnodd

source: Application logs
cy: Logiau'r adnodd

source: Sentry error monitors
cy: Monitro gwallau Sentry

source: Sensu monitoring checks
cy: Gwiriadau monitro Sensu

source: Host machine dashboards
cy: Dangosfyrddau'r peiriant lletyol

source: User satisfaction
cy: Bodlonrwydd defnyddiwr

source: Money by post
cy: Arian drwy'r post

source: MTP service
cy: Gwasanaeth MTP

source: Easy
cy: Hawdd

source: Unreasonably slow
cy: Afresymol o araf deg

source: Cheap
cy: Rhad

source: Rating
cy: Gradd

source: Response
cy: Ymateb

source: Satisfaction survey question %(question_id)s has unexpected number of options
cy: Mae gan gwestiwn %(question_id)s yn yr arolwg bodlonrwydd nifer anarferol o opsiynau

source: Satisfaction survey question %(question_id)s does not have "Not applicable" option
cy: Nid oes gan gwestiwn %(question_id)s yn yr arolwg bodlonrwydd yr opsiwn "Amherthnasol"

source: User testing the Cashbook service
cy: Profi'r gwasanaeth llyfr arian

source: Training data for the Cashbook service
cy: Data hyfforddi ar gyfer y gwasanaeth llyfr arian

source: Random set of credits
cy: Set ar hap o gredydau

source: Delete prisoner location and credit data
cy: Dileu lleoliad y carcharor a data credydau

source: "%s" is not a recognised command
cy: Nid yw "%s" yn orchymyn cydnabyddedig

source: "%(entry)s" is not a valid cron entry: %(error)s
cy: Nid yw "%(entry)s" yn ddilys: %(error)s

source: This password is too weak (use at least %(min_length)d characters)
cy: Mae'r cyfrinair hwn yn rhy wan (defnyddiwch o leiaf %(min_length)d o nodau)

source: This password is too weak (similar to %(verbose_name)s)
cy: Mae'r cyfrinair hwn yn rhy wan (tebyg i %(verbose_name)s)

source: This password is too weak (too common)
cy: Mae'r cyfrinair hwn yn rhy wan (rhy gyffredin)

source: This password is too weak (use numbers and letters)
cy: Mae'r cyfrinair hwn yn rhy wan (defnyddiwch rifau a llythrennau)

source: Recreate test data
cy: Ail-greu data prawf

source: Data reset to %(scenario)s scenario
cy: Ailosod data i %(scenario)s sefyllfa

source: status
cy: statws

source: source
cy: ffynhonnell

source: amount
cy: swm

source: Display total of selected credits
cy: Dangos y credydau sydd wedi cael eu dethol

source: Total: %s
cy: Cyfanswm: %s

source: Display credit validity of selected credits
cy: Dangos dilysrwydd credyd y credydau sydd wedi cael eu dethol

source: Of %(total)s credits: %(valid_count)s (%(valid_percent)0.2f%%) can be credited to a prisoner, %(invalid_count)s (%(invalid_percent)0.2f%%) cannot be credited.
cy: O %(total)s o gredydau: Gellir credydu %(valid_count)s (%(valid_percent)0.2f%%) i garcharor, ni ellir credydu %(invalid_count)s (%(invalid_percent)0.2f%%).

source: Display resolution time of selected credits
cy: Dangos amser prosesu'r credydau sydd wedi cael eu dethol

source: Time until credit after lock: AVG (%(avg)s), MAX (%(max)s), MIN (%(min)s)
cy: Amser tan credydu ar ôl cloi: CYF (%(avg)s), UCHAFSWM (%(max)s), ISAFSWM (%(min)s)

source: No credits have been credited yet.
cy: Nid oes credydau wedi cael eu credydu eto.

source: Time until unlock after lock: AVG (%(avg)s), MAX (%(max)s), MIN (%(min)s)
cy: Amser tan datgloi ar ôl cloi: CYF (%(avg)s), UCHAFSWM (%(max)s), ISAFSWM (%(min)s)

source: No credits have been unlocked yet.
cy: Nid oes credydau wedi cael eu datgloi eto.

source: Credits
cy: Credydau

source: Initial
cy: Arwyddo

source: Pending
cy: Aros

source: Requires manual processing
cy: Rhaid ei brosesu â llaw

source: Credited
cy: Wedi'i gredydu

source: Refunded
cy: Wedi'i ad-dalu

source: Available
cy: Ar gael

source: Locked
cy: Wedi'i gloi

source: Credit pending
cy: Credyd yn aros

source: Refund pending
cy: Aros am ad-daliad

source: Bank transfer
cy: Trosglwyddiad banc

source: Online
cy: Ar-lein

source: Unknown
cy: Anhysbys

source: Created
cy: Crëwyd

source: Unlocked
cy: Wedi'i ddatgloi

source: Uncredited
cy: Heb eu credydu

source: Reconciled
cy: Wedi'i gysoni

source: Reviewed
cy: Wedi'i adolygu

source: Marked for manual processing
cy: Eu marcio ar gyfer eu prosesu â llaw

source: Enter number of days
cy: Nodwch y nifer o ddyddiau

source: Date range
cy: Ystod dyddiad

source: Today
cy: Heddiw

source: Yesterday
cy: Ddoe

source: This week
cy: Yr wythnos hon

source: Last week
cy: Wythnos diwethaf

source: Last 4 weeks
cy: 4 wythnos ddiwethaf

source: This month
cy: Y mis hwn

source: Last month
cy: Mis diwethaf

source: Since the beginning
cy: Ers y dechrau

source: Specify a range…
cy: Nodwch ystod…

source: From date
cy: Dyddiad o

source: To date
cy: Hyd yma

source: Prison
cy: Carchar

source: All prisons
cy: Pob carchar

source: Min. time to credit
cy: Amser byrraf i brosesu credydau

source: End date must be after start date
cy: Rhaid i'r dyddiad gorffen fod ar ôl y dyddiad cychwyn

source: %(from)s to %(to)s
cy: %(from)s i %(to)s

source: only for %(prison)s
cy: dim ond ar gyfer %(prison)s

source: time to credit at least %(days)s days
cy: O leiaf %(days)s diwrnod i brosesu credyd

source: Valid credits
cy: Credydau dilys

source: Credits to refund
cy: Credydau i'w had-dalu

source: Credit report
cy: Adroddiad credyd

source: These prisoners’ accounts have been credited
cy: Mae cyfrifon y carcharorion hyn wedi cael eu credydu

source: Her Majesty’s Prison and Probation Service
cy: Gwasanaeth Carchardai a Phrawf Ei Mawrhydi

source: Prisoner money
cy: Arian carcharor

source: unknown sender
cy: anfonwr anhysbys

source: Money credited to prisoners on %(date)s at %(prison)s
cy: Arian wedi'i gredydu i garcharorion ar %(date)s yn %(prison)s

source: from %s
cy: o %s

source: Send money to someone in prison
cy: Anfon arian at rywun yn y carchar

source: Confidential. Please fold & staple
cy: Cyfrinachol. Plygwch a styffylwch

source: You have been sent money online.
cy: Mae rhywun wedi anfon arian atoch ar-lein.

source: You may not have all this money to spend in canteen.
cy: Efallai na fydd gennych yr holl arian hwn i'w wario yn y ffreutur.

source: %0.1f days
cy: %0.1f diwrnod

source: Remove lockouts
cy: Dileu cyfrifon sydd wedi cael eu cloi

source: account locked
cy: cyfrif wedi'i gloi

source: This user will be unable to manage user accounts. Either remove ‘UserAdmin’ group or choose fewer other groups.
cy: Ni fydd y defnyddiwr hwn yn gallu rheoli cyfrifon defnyddwyr. Dylech naill ai ddileu'r grŵp 'GweinyddiaethDefnyddiwr' neu ddewis llai o grwpiau eraill.

source: Prison clerks must be assigned to a prison.
cy: Mae'n rhaid i glercod carchar gael eu haseinio i garchar.

source: MTP Authorisation
cy: Awdurdodi MTP

source: That username already exists
cy: Mae'r enw defnyddiwr hwnnw yn bodoli'n barod

source: The two password fields didn’t match
cy: Nid oedd y ddau flwch cyfrinair yn cyfateb

source: That email address already exists
cy: Mae'r cyfeiriad e-bost hwnnw yn bodoli'n barod

source: Your new %(service_name)s account is ready to use
cy: Mae eich cyfrif %(service_name)s newydd yn barod i'w ddefnyddio

source: You cannot disable yourself
cy: Ni allwch analluogi eich hun

source: You’ve entered an incorrect password
cy: Rydych wedi nodi cyfrinair anghywir

source: There has been a system error. Please try again later
cy: Mae yna wall wedi digwydd yn y system. Rhowch gynnig arall arni hwyrach ymlaen.

source: Username doesn’t match any user account
cy: Nid yw'r enw defnyddiwr yn cyfateb i unrhyw gyfrif

source: Your account is locked, please contact the person who set it up
cy: Mae eich cyfrif wedi'i gloi, cysylltwch â'r unigolyn wnaeth ei greu

source: We don’t have your email address, please contact the person who set up the account
cy: Nid yw eich cyfeiriad e-bost gennym, cysylltwch â'r unigolyn wnaeth greu'r cyfrif

source: That email address matches multiple user accounts, please enter your unique username
cy: Mae'r cyfeiriad ebost yna yn cyfateb i nifer o gyfrifon defnyddwyr, nodwch eich enw defnyddiwr unigryw os gwelwch yn dda

source: Your new Prisoner Money password
cy: Eich cyfrinair Anfon Arian at Garcharor newydd

source: payment set
cy: gwneud taliad

source: payment count
cy: cyfrif taliad

source: payment amount
cy: swm y taliad

source: settled?
cy: wedi setlo?

source: settlement transaction
cy: trafodyn setlo

source: credit
cy: credyd

source: service charge
cy: tâl gwasanaeth

source: Display total of selected payments
cy: Dangos y taliadau sydd wedi cael eu dethol

source: Online Payments from GOV.UK Pay
cy: Taliadau Ar-lein gan GOV.UK Pay

source: Failed
cy: Wedi methu

source: Taken
cy: Wedi'i gymryd

source: Payment date
cy: Dyddiad y taliad

source: Card number
cy: Rhif y cerdyn

source: Only last 4 digits are required
cy: Dim ond y 4 digid olaf sydd ei angen

source: Prisoner number
cy: Rhif y carcharor

source: For reconciliation
cy: I'w cysoni

source: As specified by the sender
cy: Fel y nodwyd gan yr anfonwr

source: Specified by sender for confirmation emails
cy: Wedi'i nodi gan yr anfonwr ar gyfer negeseuon e-bost cadarnhau

source: Payment search
cy: Chwilio am daliad

source: digital take-up
cy: defnyddio gwasanaethau digidol

source: Performance
cy: Perfformiad

source: Excel file
cy: Ffeil Excel

source: Please upload a Microsoft Excel 97-2003 .xls file
cy: Llwythwch ffeil Microsoft Excel 97-2003 .xls os gwelwch yn dda

source: The spreadsheet does not contain the expected structure
cy: Mae strwythur y daenlen yn wahanol i'r disgwyl

source: The report data should be for one day only
cy: Dylai data'r adroddiad fod ar gyfer un diwrnod yn unig

source: Cannot look up prison ‘%(prison_name)s’
cy: Ni ellir chwilio am y carchar ‘%(prison_name)s’

source: Credits by post
cy: Credydau yn y post

source: Credits sent digitally
cy: Credydau wedi cael eu hanfon yn ddigidol

source: Upload spreadsheet
cy: Llwytho taenlen

source: Digital take-up saved for %(prison_count)d prisons
cy: Gwasanaethau digidol wedi'i harbed ar gyfer %(prison_count)d carchar

source: We received credits at these prisons, but spreadsheet is missing them:
cy: Cawsom gredydau yn y carchardai hyn, ond nid ydynt ar y daenlen:

source: We did not receive credits at these prisons, but spreadsheet has them:
cy: Ni chawsom gredydau yn y carchardai hyn, ond mae yna rai ar y daenlen:

source: Credits received do not match those in the spreadsheet:
cy: Nid yw'r credydau a cafwyd yn cyfateb i'r rhai sydd ar y daenlen:

source: Prison name does not start with a standard prefix.
cy: Nid yw enw'r carchar yn dechrau â rhagddodiad safonol.

source: Prisoner management
cy: Rheoli carcharor

source: Invalid prisoner number
cy: Rhif carcharor annilys

source: No prison found with code "{pk_value}"
cy: Ni ddaethpwyd o hyd i unrhyw garchar gyda'r cod "{pk_value}"

source: cardholder names
cy: Enwau perchennog y cerdyn

source: sender names
cy: enwau'r anfonwr

source: payment method
cy: dull talu

source: Debit card
cy: Cerdyn debyd

source: credit total
cy: cyfanswm y credydau

source: names specified by senders
cy: enwau a nodwyd gan anfonwyr

source: filters
cy: hidlwyr

source: Security data
cy: Data diogelwch

source: (Unknown)
cy: (Anhysbys)

source: Service availability
cy: Argaeledd y gwasanaeth

source: type
cy: math

source: Display total of selected transactions
cy: Dangos y trafodion sydd wedi cael eu dethol

source: Transactions from bank statement
cy: Trafodion o gyfriflen banc

source: Creditable
cy: Mae modd ei gymeradwyo

source: Refundable
cy: Mae modd ei ad-dalu

source: Anonymous
cy: Anhysbys

source: Unidentified
cy: Anhysbys

source: Anomalous
cy: Afreolaidd

source: Reconcilable
cy: Mae modd ei gysoni

source: Debit
cy: Debyd

source: Credit
cy: Credyd

source: Administrative
cy: Gweinyddol

source: Invalid date format
cy: Fformat annilys i'r dyddiad

source: This user is locked out
cy: Mae'r defnyddiwr hwn wedi cael ei gloi alan

source: Edit
cy: Golygu

source: Has no access to any applications.
cy: Dim mynediad i'r adnodd hwn.

source: Add
cy: Ychwanegu

source: Not registered at any prison.
cy: Heb ei gofrestru mewn unrhyw garchar.

source: App version %(version)s
cy: Ap fersiwn %(version)s

source: Logged in as <strong>%(user_name)s</strong>.
cy: Wedi mewngofnodi fel <strong>%(user_name)s</strong>.

source: Reports
cy: Adroddiadau

source: Change
cy: Newid

source: You don’t have permission to edit anything.
cy: Nid oes gennych ganiatâd i olygu unrhyw beth.

source: Testing tools
cy: Adnoddau profi:

source: This cannot be undone!
cy: Ni ellir dadwneud hyn!

source: Recreate
cy: Ail-greu

source: Language
cy: Iaith

source: Select a language
cy: Dewiswch iaith

source: Switch
cy: Newid

source: Recent Actions
cy: Camau gweithredu diweddar

source: Unknown content
cy: Cynnwys anhysbys

source: Home
cy: Cartref

source: Payments by card expiring %(card_expiry)s
cy: Taliadau gyda cherdyn sy'n dod i ben %(card_expiry)s

source: Find
cy: Darganfod

source: Upload
cy: Llwytho

source: Update
cy: Diweddaru

source: By %(filter_title)s
cy: Erbyn %(filter_title)s

source: Readable
cy: Darllenadwy

source: Invalid
cy: Annilys

source: Debit cards
cy: Cardiau debyd

source: No prison
cy: Dim carchar

source: Hide
cy: Cuddio

source: Output log
cy: Log allbwn

source: These actions will delete and recreate sample data. They cannot be undone.
cy: Bydd y camau hyn yn dileu ac yn ailgreu data sampl. Ni ellir eu dadwneud.

source: Dear staff member,
cy: Annwyl aelod o staff,

source: Attached are the credit slips for prisoners whose accounts have recently been digitally credited.
cy: Yn atodedig mae'r slipiau credyd i garcharorion y mae eu cyfrifon wedi cael eu credydu'n ddigidol.

source: Please print them out and deliver them confidentially to individuals’ cells.
cy: Argraffwch nhw a'u hanfon yn gyfrifachol i gelloedd yr unigolion.

source: Thank you for your co-operation.
cy: Diolch yn fawr am eich cydweithrediad.

source: Your new %(service_name)s account has been created for you.
cy: Mae eich cyfrif %(service_name)s newydd wedi cael ei greu i chi.

source: Username
cy: Enw defnyddiwr

source: Password
cy: Cyfrinair

source: Your new Prisoner Money password has been created for you.
cy: Mae eich cyfrinair Arian Carcharor newydd wedi'i greu.

source: Page not found
cy: Ni ellir dod o hyd i’r dudalen

source: Sorry, something went wrong
cy: Mae'n ddrwg iawn gennym, aeth rhywbeth o'i le
